import React , {useState} from "react";

const Slider = () => {
    const [slider , setSlider] = useState([
        {
            id: 1,
            title: "Концепція",
            Description: "Одеський міжнародний кінофестиваль — головний фестиваль національного кіно. Саме на ОМКФ проходять прем’єри найбільш очікуваних національних фільмів, а також дебютують молоді таланти.\n\n" +
            "Окрім того, ОМКФ є справжнім фестивалем прем’єр. У позаконкурсних програмах Одеського міжнародного кінофестивалю глядачі мають ексклюзивну можливість першими побачити міжнародні фестивальні хіти (секція “Фестиваль фестивалів”), а також арт-хіти, які невдовзі виходитимуть в український прокат (секція “Гала-прем’єри”).\n\n" +
            "Програмний фокус Одеського МКФ — фільми напрямку «арт-мейнстрім», яким притаманна висока художня якість та які доступні широкій аудиторії.",
            isClicked: true,
        },
        {
            id: 2,
            title: "Програми",
            Description: "До 2021 року на кінофестивалі проходили три конкурсні програми: Міжнародна та Національна, а також Конкурс європейських документальних фільмів.\n\n" +
            "У 2021 році Одеський міжнародний кінофестиваль приурочений до 30-річчя незалежності України з акцентом на національне кіно. Єдина конкурсна програма оновленого фестивалю — Національний Конкурс (повний і короткий метр), переможці якого отримують нагороди за найкращий фільм, найкращу режисуру та найкращі акторські роботи.\n\n" +
            "Національна конкурсна програма складається з новітніх фільмів, знятих в Україні або в копродукції з Україною. У конкурсі можуть брати участь як повнометражні, так і короткометражні роботи українських кінематографістів. Програму Національного конкурсу оцінює професійне журі, до складу якого входять українські та міжнародні кінопрофесіонали.\n\n" +
            "Гран-Прі “Золотий Дюк” вручається фільму-переможцю за результатами глядацького голосування, адже ОМКФ — насамперед глядацький кінофестиваль і головним арбітром на ньому завжди є глядач.",
            isClicked: false,
        },
        {
            id: 3,
            title: "Події",
            Description: "Одна з основних місій Одеського міжнародного кінофестивалю — розвиток професійної кіногалузі в Україні.\n\n" +
            "ОМКФ — головний індустрійний майданчик країни, де спілкуються і налагоджують співпрацю кінопрофесіонали з усіх сегментів індустрії. Професійний вікенд на ОМКФ - це можливості та інструменти для співпраці між талантами, продюсерами, кінофондами, фестивалями, кінотеатрами, дистриб’юторами, а також представниками ТБ та інших медіа.\n\n" +
            "До участі у програмі Film Industry Office Одеського міжнародного кінофестивалю запрошуються українські кінематографісти, які мають свої повнометражні фільми на різних стадіях — на рівні проекту (секція “Пітчинг”), відзнятого матеріалу (Work in progress). Режисери, продюсери, менеджери кіно, профільні чиновники стають учасниками конференцій і дискусій на актуальні теми сучасного українського кінопроцесу, а також розширюють мережу своїх контактів серед зарубіжних кінопрофесіоналів.\n\n" +
            "Ще однією професійною подією Одеського кінофестивалю є український Кіноринок — єдиний в країні професійний майданчик для спілкування дистриб'юторів, представників кінотеатрів, кіностудій та компаній, що надають послуги в сфері прокату та інші послуги.",
            isClicked: false,
        },
        {
            id: 4,
            title: "Освітні секції",
            Description: "Майбутні професіонали кіно стають студентами Літньої кіношколи ОМКФ. Це один із найбільших проектів ОМКФ, де майстер-класи та творчі зустрічі проводять знані світові та українські кінематографісти, володарі численних премій та нагород, автори легендарних світових кінофільмів.\n\n" +
            "Викладачами та гостями Кіношколи в різні роки були Крістофер Хемптон, Крістіан Петцольд, Пітер Грінуей, Кшиштоф Зануссі, Джон Малкович, Роджер Корман, Клаудіа Кардіналле, Деріл Ханна, Марко Мюллер, Даррен Аронофскі, Пітер Веббер, Йос Стеллінг, Джим Шерідан, Майкл Вінтерботтом, Іржі Менцель, Сергій Лозниця, Кіра Муратова, Тодд Солондз, Стівен Фрірз, Джеральдіна Чаплін, Ейдан Тернер та інші.",
            isClicked: false,
        },
        {
            id: 5,
            title: "Показ на Потьомкінських сходах ",
            Description: "Наймасштабніша подія Одеського міжнародного кінофестивалю — традиційний open air кіноперформанс на Потьомкінських сходах. Це культове кінематографічне місце прославив на весь світ режисер Сергій Ейзенштейн у фільмі “Броненосець Потьомкін” (1925). Під час фестивалю знамениті Потьомкінські сходи стають величезним кінотеатром під відкритим небом, де у супроводі живого симфонічного оркестру демонструються шедеври німого кіно.\n\n" +
            "У різні роки тут були показані «Вогні великого міста» Чарлі Чапліна, «Метрополіс» Фріца Ланга, «Схід сонця» Фрідріха В. Мурнау, «Шантаж» Альфреда Хічкока, «Людина з кіноапаратом» Дзиги Вертова в авторському музичному оформленні Майкла Наймана, «Шерлок Холмс» Артура Бертелета, «Дамське щастя» Жюльєна Дювів'є і, звичайно ж, «Броненосець Потьомкін» Сергія Ейзенштейна.\n\n" +
            "У 2015 році за сприяння Одеського міжнародного кінофестивалю Європейська кіноакадемія присвоїла Потьомкінським сходам статус “Скарб європейської кінокультури”.",
            isClicked: false,
        }
    ])
    
    const [isButtonClicked, setIsButtonClicked] = useState(false);
    const [currentItems, setCurrentItems] = useState({title: "Концепція",
    Description: "Одеський міжнародний кінофестиваль — головний фестиваль національного кіно. Саме на ОМКФ проходять прем’єри найбільш очікуваних національних фільмів, а також дебютують молоді таланти.\n\n" +
    "Окрім того, ОМКФ є справжнім фестивалем прем’єр. У позаконкурсних програмах Одеського міжнародного кінофестивалю глядачі мають ексклюзивну можливість першими побачити міжнародні фестивальні хіти (секція “Фестиваль фестивалів”), а також арт-хіти, які невдовзі виходитимуть в український прокат (секція “Гала-прем’єри”).\n\n" +
    "Програмний фокус Одеського МКФ — фільми напрямку «арт-мейнстрім», яким притаманна висока художня якість та які доступні широкій аудиторії.",
    isClicked: true,
    });

    
   
    const addItem = (id) => {
        const item = slider.find((el) => el.id === id);
        setCurrentItems(item);
        
        const updateBtn = slider.map((item) => {
            if(item.id == id){
                return{
                     ...item,
                    isClicked : true
                }
               
            } else {
                return{
                    ...item,
                   isClicked : false
               }
            }
        })
        setSlider(updateBtn);
        
        let btn = document.querySelector(".Slider_Btn")
        let blockAnim = document.querySelector(".Slider_Information")
        
        if(blockAnim.classList.contains("Slider_Information")){
            
            blockAnim.style.animation = "start 0.3s"
            blockAnim.addEventListener("animationend" , function(){
                blockAnim.style = ""
                 
            })
        }
    }
    
   
    
    
    
    return(
        <div className="Slider_Container">
            <div className="Slider_Content">
                <div className="Slider_Information" data-aos="zoom-out" data-aos-offset="100" data-aos-duration="1500">
                    <div className="Slider_Information_Label " >
                        <span>{currentItems.title}</span>
                    </div>

                    <div className="Slider_Information_Text" >
                        <span>
                            {currentItems.Description}
                        </span>
                    </div>
                </div>

                <div className="Slider_Menu" data-aos="zoom-out" data-aos-offset="100" data-aos-duration="1500">
                    <ul>
                         {slider.map((item) => (
                        
                        <li className={`Slider_Btn ${item.isClicked ? 'red active' : ''}`} style={{backgroundColor: item.isClicked ? '#CF0032' : ''}} id={item.id} onClick={() => {
                            addItem(item.id)
                            
                            } }>
                            {item.title}
                        </li>  
        
                        
                    ))} 
                    
                    </ul> 
               
                </div>
            </div>
        </div>
    )
}
export default Slider